# Creating Database

In [73]:
%load_ext sql
#% is python magic command

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [74]:
%sql sqlite://
#sql is not case-sensitive

### How to Create Table

In [75]:
%%sql CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15),
FIRST_NAME CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2) 
);

 * sqlite://
(sqlite3.OperationalError) table rep already exists
[SQL: CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15),
FIRST_NAME CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### How to modify existing table

In [76]:
%sql DROP TABLE rep;

 * sqlite://
Done.

[]

In [77]:
%%sql CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15) NOT NULL,
FIRST_NAME CHAR(15) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2) 
);

 * sqlite://
Done.

[]

In [78]:
%%sql
INSERT INTO rep
VALUES
('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.50, 0.05)

 * sqlite://
1 rows affected.

[]

### Inserting a row that contains null values

In [79]:
%sql INSERT INTO rep (REP_NUM, LAST_NAME, FIRST_NAME) VALUES ('85', 'Webb', 'Tina');

 * sqlite://
1 rows affected.

[]

In [80]:
%%sql
INSERT INTO rep
VALUES
('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05);

 * sqlite://
2 rows affected.

[]

### Update Records

In [81]:
%%sql 
UPDATE rep
SET last_name = 'Perry'
WHERE rep_num = '85';

 * sqlite://
1 rows affected.

[]

### Deleting Records

In [82]:
%sql DELETE FROM rep WHERE rep_num = '85'

 * sqlite://
1 rows affected.

[]

### Creating The Remaining Database

In [83]:
%%sql
CREATE TABLE CUSTOMER
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2),
REP_NUM CHAR(2) );

 * sqlite://
(sqlite3.OperationalError) table CUSTOMER already exists
[SQL: CREATE TABLE CUSTOMER
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2),
REP_NUM CHAR(2) );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [84]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20'),
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35'),
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65'),
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35'),
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65'),
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20'),
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65'),
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35'),
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35'),
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: CUSTOMER.CUSTOMER_NUM
[SQL: INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20'),
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35'),
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65'),
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35'),
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65'),
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20'),
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65'),
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35'),
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35'),
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [85]:
%sql SELECT * FROM CUSTOMER

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '2837 Greenway', 'Fillmore', 'FL', '33336', 6550, 7500, '20'),
 ('282', 'Brookings Direct', '3827 Devon', 'Grove', 'FL', '33321', 431.5, 10000, '35'),
 ('356', "Ferguson's", '382 Wildwood', 'Northfield', 'FL', '33146', 5785, 7500, '65'),
 ('408', 'The Everything Shop', '1828 Raven', 'Crystal', 'FL', '33503', 5285.25, 5000, '35'),
 ('462', 'Bargains Galore', '3829 Central', 'Grove', 'FL', '33321', 3412, 10000, '65'),
 ('524', "Kline's", '838 Ridgeland', 'Fillmore', 'FL', '33336', 12762, 15000, '20'),
 ('608', "Johnson's Department Store", '372 Oxford', 'Sheldon', 'FL', '33553', 2106, 10000, '65'),
 ('687', "Lee's Sport and Appliance", '282 Evergreen', 'Altonville', 'FL', '32543', 2851, 5000, '35'),
 ('725', "Deerfield's Four Seasons", '282 Columbia', 'Sheldon', 'FL', '33553', 248, 7500, '35'),
 ('842', 'All Season', '28 Lakeview', 'Grove', 'FL', '33321', 8221, 7500, '20')]

In [86]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3) );

 * sqlite://
(sqlite3.OperationalError) table ORDERS already exists
[SQL: CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3) );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [87]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148'),
('21610','20-OCT-2010','356'),
('21613','21-OCT-2010','408'),
('21614','21-OCT-2010','282'),
('21617','23-OCT-2010','608'),
('21619','23-OCT-2010','148'),
('21623','23-OCT-2010','608');

 * sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: ORDERS.ORDER_NUM
[SQL: INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148'),
('21610','20-OCT-2010','356'),
('21613','21-OCT-2010','408'),
('21614','21-OCT-2010','282'),
('21617','23-OCT-2010','608'),
('21619','23-OCT-2010','148'),
('21623','23-OCT-2010','608');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [88]:
%sql SELECT * FROM ORDERS

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

In [89]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
(sqlite3.OperationalError) table PART already exists
[SQL: CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [90]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: PART.PART_NUM
[SQL: INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [91]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
(sqlite3.OperationalError) table ORDER_LINE already exists
[SQL: CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [92]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: ORDER_LINE.ORDER_NUM, ORDER_LINE.PART_NUM
[SQL: INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

### Displaying Tables

In [93]:
%%sql
SELECT * FROM REP;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05)]

In [94]:
%%sql
SELECT * FROM CUSTOMER;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '2837 Greenway', 'Fillmore', 'FL', '33336', 6550, 7500, '20'),
 ('282', 'Brookings Direct', '3827 Devon', 'Grove', 'FL', '33321', 431.5, 10000, '35'),
 ('356', "Ferguson's", '382 Wildwood', 'Northfield', 'FL', '33146', 5785, 7500, '65'),
 ('408', 'The Everything Shop', '1828 Raven', 'Crystal', 'FL', '33503', 5285.25, 5000, '35'),
 ('462', 'Bargains Galore', '3829 Central', 'Grove', 'FL', '33321', 3412, 10000, '65'),
 ('524', "Kline's", '838 Ridgeland', 'Fillmore', 'FL', '33336', 12762, 15000, '20'),
 ('608', "Johnson's Department Store", '372 Oxford', 'Sheldon', 'FL', '33553', 2106, 10000, '65'),
 ('687', "Lee's Sport and Appliance", '282 Evergreen', 'Altonville', 'FL', '32543', 2851, 5000, '35'),
 ('725', "Deerfield's Four Seasons", '282 Columbia', 'Sheldon', 'FL', '33553', 248, 7500, '35'),
 ('842', 'All Season', '28 Lakeview', 'Grove', 'FL', '33321', 8221, 7500, '20')]

In [95]:
%%sql
SELECT * FROM ORDERS;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

In [96]:
%%sql
SELECT * FROM ORDER_LINE;

 * sqlite://
Done.

[('21608', 'AT94', 11, 21.95),
 ('21610', 'DR93', 1, 495),
 ('21610', 'DW11', 1, 399.99),
 ('21613', 'KL62', 4, 329.95),
 ('21614', 'KT03', 2, 595),
 ('21617', 'BV06', 2, 794.95),
 ('21617', 'CD52', 4, 150),
 ('21619', 'DR93', 1, 495),
 ('21623', 'KV29', 2, 1290)]

In [97]:
%%sql
SELECT * FROM PART;

 * sqlite://
Done.

[('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390)]

## A. Warm-up SQL Fundamentals

A.1. List the names of all customers that have a credit limit of $7,500 or less.

In [98]:
%%sql
SELECT customer_name
FROM customer
WHERE credit_limit <= 7500;

 * sqlite://
Done.

[("Al's Appliance and Sport",),
 ("Ferguson's",),
 ('The Everything Shop',),
 ("Lee's Sport and Appliance",),
 ("Deerfield's Four Seasons",),
 ('All Season',)]

A.2. List the order numbers for orders placed by customer number 608 on 10/23/2010.

In [99]:
%%sql
SELECT order_num
FROM orders
WHERE customer_num = '608' AND order_date = '23-OCT-2010';

 * sqlite://
Done.

[('21617',), ('21623',)]

A.3. List the part number and part description of all parts that are in item class HW.

In [100]:
%%sql 
SELECT part_num, description
FROM part
WHERE class = 'HW';

 * sqlite://
Done.

[('AT94', 'Iron'), ('DL71', 'Cordless Drill'), ('FD21', 'Stand Mixer')]

A.4. List the part number, part description, and on-hand value for each part in item class SG. (Hint: On-hand value is the result of multiplying the number of units on hand by the price.)

In [101]:
%%sql 
SELECT part_num, description, on_hand * price AS ON_HAND_VALUE
FROM part
WHERE class = 'SG';

 * sqlite://
Done.

[('BV06', 'Home Gym', 35772.75), ('KV29', 'Treadmill', 12510)]

A.5. How many customers have a balance that exceeds their credit limit?

In [145]:
%%sql
SELECT COUNT(customer_name) AS COUNT_EXCEEDS_LIMIT
FROM customer
WHERE credit_limit < balance;

 * sqlite://
Done.

[(2,)]

A.6. What is the part number, description, and price of the least expensive part in the database?

In [146]:
%%sql
SELECT part_num, description, price
FROM part
ORDER BY price ASC
LIMIT 1;

 * sqlite://
Done.

[('AT94', 'Iron', 24.95)]

A.7. For each order, list the order number, order date, customer number, and customer name.

In [149]:
%%sql
SELECT order_num, order_date, orders.customer_num, customer_name
FROM orders
LEFT JOIN customer
ON orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

A.8. For each order placed on October 21, 2010, list the order number, customer number, and customer name.

In [105]:
%%sql
SELECT order_num, orders.customer_num, customer_name
FROM orders
LEFT JOIN customer
ON orders.customer_num = customer.customer_num
WHERE order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', '408', 'The Everything Shop'), ('21614', '282', 'Brookings Direct')]

A.9. For each order placed on October 21, 2010, list the order number, part number, part description, and item class for each part ordered.

In [106]:
%%sql
SELECT orders.order_num, order_line.part_num, part.description, part.class
FROM orders
LEFT JOIN order_line
ON orders.order_num = order_line.order_num
LEFT JOIN part
ON part.part_num = order_line.part_num
WHERE order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', 'KL62', 'Dryer', 'AP'), ('21614', 'KT03', 'Dishwasher', 'AP')]

## B. Database Design

B. By writing SQL commands for the necessary changes only (i.e., we assume all other commands are given as in the Premier Products database that we created in class and you only need to create the new/modified tables as discussed below) support the following requirements.

Hint: To avoid conflicts with existing tables, simply number the new tables by appending the question number, e.g., for part 1 of this question name the customer table customer1.

Hint 2: As figures that you include into the Jupyter notebook using img src="E-R.png" are not saved with the notebook but remain links to exernal files, please submit your figures in an additional document.

B.1. A customer is not necessarily represented by a single sales rep, but can be represented by several sales reps. When a customer places an order, the sales rep who gets the commission on the order must be in the collection of sales reps who represent the customer. Draw an E-R diagram for the new design and write SQL commands to create tables that are different from the existing tables only.

In [107]:
%%sql
CREATE TABLE REP1
(REP_NUM CHAR(2),
CUSTOMER_NUM CHAR(3) PRIMARY KEY,
LAST_NAME CHAR(15) NOT NULL,
FIRST_NAME CHAR(15) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISSION DECIMAL(7,2),
RATE DECIMAL(3,2) )

 * sqlite://
(sqlite3.OperationalError) table REP1 already exists
[SQL: CREATE TABLE REP1
(REP_NUM CHAR(2),
CUSTOMER_NUM CHAR(3) PRIMARY KEY,
LAST_NAME CHAR(15) NOT NULL,
FIRST_NAME CHAR(15) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISSION DECIMAL(7,2),
RATE DECIMAL(3,2) )]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [108]:
%%sql
CREATE TABLE CUSTOMER1
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2))

 * sqlite://
(sqlite3.OperationalError) table CUSTOMER1 already exists
[SQL: CREATE TABLE CUSTOMER1
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

B.2. There is no relationship between customers and sales reps. When a customer places an order, any sales rep can process the order. On the order, you need to identify both the customer placing the order and the sales rep responsible for the order. Draw an E-R diagram for the new design and write SQL commands to create tables that are different from the existing tables only.

In [109]:
%%sql
CREATE TABLE CUSTOMER2
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2))

 * sqlite://
(sqlite3.OperationalError) table CUSTOMER2 already exists
[SQL: CREATE TABLE CUSTOMER2
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [110]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3),
REP_NUM CHAR(2));

 * sqlite://
(sqlite3.OperationalError) table ORDERS already exists
[SQL: CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3),
REP_NUM CHAR(2));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

B.3. Using your knowledge of Premiere Products, determine the functional dependencies that exist in the following table. After determining the functional dependencies, convert this table to an equivalent collection of tables that are in third normal form. PART (PART_NUM, DESCRIPTION, ON_HAND, CLASS, WAREHOUSE, PRICE, (ORDER_NUM, ORDER_DATE, CUSTOMER_NUM, CUSTOMER_NAME, NUM_ORDERED, QUOTED_PRICE) )
PART_NUM is the primary key of this table. The highlighted text indicates repeating groups, i.e., each part occurs in many orders for which we record the order number, date, customer number and so forth.
Draw an E-R diagram and write SQL commands that create the collection of tables in 3NF.

Functional dependencies
Customer_name is functionally dependent on customer_num
Order date is functionally dependent on order_num
Description, on_hand, class, warehouse and price are functionally dependent on part_num
Num_ordered is functionally dependent on part_num and quoted price

In [111]:
%%sql
CREATE TABLE CUSTOMER3
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL)

 * sqlite://
(sqlite3.OperationalError) table CUSTOMER3 already exists
[SQL: CREATE TABLE CUSTOMER3
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [112]:
%%sql
CREATE TABLE ORDERS3
(ORDER_NUM CHAR(5) PRIMARY KEY,
CUSTOMER_NUM CHAR(3),
ORDER_DATE DATE);

 * sqlite://
(sqlite3.OperationalError) table ORDERS3 already exists
[SQL: CREATE TABLE ORDERS3
(ORDER_NUM CHAR(5) PRIMARY KEY,
CUSTOMER_NUM CHAR(3),
ORDER_DATE DATE);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [113]:
%%sql
CREATE TABLE PART3
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2));

 * sqlite://
(sqlite3.OperationalError) table PART3 already exists
[SQL: CREATE TABLE PART3
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [114]:
%%sql
CREATE TABLE ORDER_LINE3
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (PART_NUM, ORDER_NUM) );

 * sqlite://
(sqlite3.OperationalError) table ORDER_LINE3 already exists
[SQL: CREATE TABLE ORDER_LINE3
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (PART_NUM, ORDER_NUM) );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## C. Fundamental SQL

C.1. List the number and name of each customer represented by sales rep 35 or sales rep 65.

In [115]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE REP_NUM = 35 or REP_NUM = 65;

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('608', "Johnson's Department Store"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons")]

C.2. List the part number and part description of each part that is not in item class AP.

In [116]:
%%sql
SELECT PART_NUM, DESCRIPTION
FROM PART
WHERE CLASS != 'AP';

 * sqlite://
Done.

[('AT94', 'Iron'),
 ('BV06', 'Home Gym'),
 ('DL71', 'Cordless Drill'),
 ('FD21', 'Stand Mixer'),
 ('KV29', 'Treadmill')]

C.3. List the part number, description, and number of units on hand for each part that has
between 10 and 25 units on hand, including both 10 and 25. Do this in different two ways.

C.3.1

In [117]:
%%sql
SELECT PART_NUM, DESCRIPTION, ON_HAND
FROM PART
WHERE ON_HAND >= 10 and ON_HAND <=25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

C.3.2

In [118]:
%%sql
SELECT PART_NUM, DESCRIPTION, ON_HAND
FROM PART
WHERE ON_HAND BETWEEN 10 and 25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

C.4. Use the IN operator to list the part number and part description of each part in item class AP or SG.

In [119]:
%%sql
SELECT PART_NUM, DESCRIPTION
FROM PART
WHERE CLASS IN ('AP', 'SG');

 * sqlite://
Done.

[('BV06', 'Home Gym'),
 ('CD52', 'Microwave Oven'),
 ('DR93', 'Gas Range'),
 ('DW11', 'Washer'),
 ('KL62', 'Dryer'),
 ('KT03', 'Dishwasher'),
 ('KV29', 'Treadmill')]

C.5. Find the number and name of each customer whose name begins with the letter B.

In [120]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE CUSTOMER_NAME LIKE "B%"

 * sqlite://
Done.

[('282', 'Brookings Direct'), ('462', 'Bargains Galore')]

C.6. List all details about all parts. Order the output by part description.

In [121]:
%%sql
SELECT * 
FROM PART
ORDER BY DESCRIPTION;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99)]

C.7. List all details about all parts. Order the output by part number within warehouse. (That is, order the output by warehouse and then by part number.)

In [122]:
%%sql
SELECT * 
FROM PART
ORDER BY WAREHOUSE, PART_NUM;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595)]

C.8. List the part number, part description, and on-hand value of each part whose number of units on hand is more than the average number of units on hand for all parts. (Hint: Use a subquery.)

In [123]:
%%sql
SELECT PART_NUM, DESCRIPTION, ON_HAND
FROM PART, 
    (SELECT AVG(ON_HAND) AS avg_on_hand FROM PART) Q
WHERE ON_HAND > avg_on_hand;

 * sqlite://
Done.

[('AT94', 'Iron', 50),
 ('BV06', 'Home Gym', 45),
 ('CD52', 'Microwave Oven', 32),
 ('FD21', 'Stand Mixer', 22)]

C.9. List the sum of the balances of all customers for each sales rep. Order and group the results by sales rep number.

In [124]:
%%sql
SELECT REP_NUM, SUM(BALANCE) AS sum_balance
FROM CUSTOMER
GROUP BY REP_NUM
ORDER BY REP_NUM;

 * sqlite://
Done.

[('20', 27533), ('35', 8815.75), ('65', 11303)]

C.10. List the sum of the balances of all customers for each sales rep, but restrict the output to those sales reps for which the sum is more than $10,000. Order the results by sales rep number.

In [125]:
%%sql
SELECT REP_NUM, SUM(BALANCE) AS sum_balance
FROM CUSTOMER
GROUP BY REP_NUM
HAVING SUM(BALANCE) > 10000
ORDER BY REP_NUM;

 * sqlite://
Done.

[('20', 27533), ('65', 11303)]

C.11. List the part number of any part with an unknown description.

In [126]:
%%sql
SELECT PART_NUM
FROM PART 
WHERE DESCRIPTION IS NULL;

 * sqlite://
Done.

[]

# D. More Advanced SQL

D.1. For each order, list the order number and order date along with the number and name of the customer that placed the order.

In [127]:
%%sql
SELECT order_num, order_date, customer.customer_num, customer_name
FROM orders
LEFT JOIN customer
ON orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

D.2. For each order placed on October 23, 2010, list the order number along with the number and name of the customer that placed the order

In [128]:
%%sql
SELECT order_num, customer.customer_num, customer_name
FROM orders
LEFT JOIN customer
ON orders.customer_num = customer.customer_num
WHERE order_date = '23-OCT-2010';

 * sqlite://
Done.

[('21617', '608', "Johnson's Department Store"),
 ('21619', '148', "Al's Appliance and Sport"),
 ('21623', '608', "Johnson's Department Store")]

D.3. For each order, list the order number, order date, part number, number of units ordered, and quoted price for each order line that makes up the order.

In [129]:
%%sql
SELECT orders.order_num, order_date, part_num, num_ordered, quoted_price
FROM orders
LEFT JOIN order_line
ON orders.order_num = order_line.order_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 11, 21.95),
 ('21610', '20-OCT-2010', 'DR93', 1, 495),
 ('21610', '20-OCT-2010', 'DW11', 1, 399.99),
 ('21613', '21-OCT-2010', 'KL62', 4, 329.95),
 ('21614', '21-OCT-2010', 'KT03', 2, 595),
 ('21617', '23-OCT-2010', 'BV06', 2, 794.95),
 ('21617', '23-OCT-2010', 'CD52', 4, 150),
 ('21619', '23-OCT-2010', 'DR93', 1, 495),
 ('21623', '23-OCT-2010', 'KV29', 2, 1290)]

D.4. Use the IN operator to find the number and name of each customer that placed an order on October 23, 2010.

In [130]:
%%sql
SELECT customer_num, customer_name
FROM customer
WHERE customer_num IN 
(SELECT customer_num FROM orders
WHERE order_date = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

D.5. Repeat Exercise 4, but this time use the EXISTS operator in your answer.

In [131]:
%%sql
SELECT customer_num, customer_name
FROM customer
WHERE EXISTS
(SELECT * FROM orders
WHERE orders.customer_num = customer.customer_num AND order_date = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

D.6. Find the number and name of each customer that did not place an order on October 23, 2010.

In [132]:
%%sql
SELECT customer_num, customer_name
FROM customer
WHERE customer_num NOT IN 
(SELECT customer_num FROM orders
WHERE order_date = '23-OCT-2010');

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('524', "Kline's"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons"),
 ('842', 'All Season')]

D.7. For each order, list the order number, order date, part number, part description, and item class for each part that makes up the order.

In [133]:
%%sql
SELECT orders.order_num, order_date, order_line.part_num, part.description, part.class
FROM orders
LEFT JOIN order_line
ON orders.order_num = order_line.order_num
LEFT JOIN part
ON part.part_num = order_line.part_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 'Iron', 'HW'),
 ('21610', '20-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21610', '20-OCT-2010', 'DW11', 'Washer', 'AP'),
 ('21613', '21-OCT-2010', 'KL62', 'Dryer', 'AP'),
 ('21614', '21-OCT-2010', 'KT03', 'Dishwasher', 'AP'),
 ('21617', '23-OCT-2010', 'BV06', 'Home Gym', 'SG'),
 ('21617', '23-OCT-2010', 'CD52', 'Microwave Oven', 'AP'),
 ('21619', '23-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21623', '23-OCT-2010', 'KV29', 'Treadmill', 'SG')]

D.8. Repeat Exercise 7, but this time order the rows by item class and then by order number.

In [134]:
%%sql
SELECT orders.order_num, order_date, order_line.part_num, part.description, part.class
FROM orders
LEFT JOIN order_line
ON orders.order_num = order_line.order_num
LEFT JOIN part
ON part.part_num = order_line.part_num
ORDER BY part.class, orders.order_num;

 * sqlite://
Done.

[('21610', '20-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21610', '20-OCT-2010', 'DW11', 'Washer', 'AP'),
 ('21613', '21-OCT-2010', 'KL62', 'Dryer', 'AP'),
 ('21614', '21-OCT-2010', 'KT03', 'Dishwasher', 'AP'),
 ('21617', '23-OCT-2010', 'CD52', 'Microwave Oven', 'AP'),
 ('21619', '23-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21608', '20-OCT-2010', 'AT94', 'Iron', 'HW'),
 ('21617', '23-OCT-2010', 'BV06', 'Home Gym', 'SG'),
 ('21623', '23-OCT-2010', 'KV29', 'Treadmill', 'SG')]

D.9. Use a subquery to find the rep number, last name, and first name of each sales rep who represents at least one customer with a credit limit of $10,000. List each sales rep only once in the results.

In [135]:
%%sql
SELECT rep_num, last_name, first_name
FROM rep
WHERE rep_num IN
(SELECT rep_num FROM customer
WHERE credit_limit = 10000);

 * sqlite://
Done.

[('35', 'Hull', 'Richard'), ('65', 'Perez', 'Juan')]

D.10. Repeat Exercise 9, but this time do not use a subquery.

In [136]:
%%sql
SELECT DISTINCT rep.rep_num, last_name, first_name
FROM rep
LEFT JOIN customer 
ON rep.rep_num = customer.rep_num
WHERE credit_limit = 10000;

 * sqlite://
Done.

[('35', 'Hull', 'Richard'), ('65', 'Perez', 'Juan')]

D.11. Find the number and name of each customer that currently has an order on file for a
Gas Range.

In [137]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER 
    NATURAL JOIN ORDERS
    NATURAL JOIN ORDER_LINE 
    NATURAL JOIN PART
WHERE DESCRIPTION = 'Gas Range';

 * sqlite://
Done.

[('356', "Ferguson's"), ('148', "Al's Appliance and Sport")]

D.12. List the part number, part description, and item class for each pair of parts that are in the same item class. (For example, one such pair would be part AT94 and part FD21, because the item class for both parts is HW.)

Assume we want non-duplicate pairs: 
e.g. (AT94, FD21) and (FD21, AT94) represent same pairs.

In [138]:
%%sql
SELECT A.CLASS,
       A.PART_NUM AS PART_NUM_1, 
       A.DESCRIPTION AS DESCRIPTION_1,
       B.PART_NUM AS PART_NUM_2, 
       B.DESCRIPTION AS DESCRIPTION_2
FROM PART A, PART B
WHERE A.CLASS = B.CLASS 
    AND A.PART_NUM < B.PART_NUM;

 * sqlite://
Done.

[('HW', 'AT94', 'Iron', 'DL71', 'Cordless Drill'),
 ('HW', 'AT94', 'Iron', 'FD21', 'Stand Mixer'),
 ('SG', 'BV06', 'Home Gym', 'KV29', 'Treadmill'),
 ('AP', 'CD52', 'Microwave Oven', 'DR93', 'Gas Range'),
 ('AP', 'CD52', 'Microwave Oven', 'DW11', 'Washer'),
 ('AP', 'CD52', 'Microwave Oven', 'KL62', 'Dryer'),
 ('AP', 'CD52', 'Microwave Oven', 'KT03', 'Dishwasher'),
 ('HW', 'DL71', 'Cordless Drill', 'FD21', 'Stand Mixer'),
 ('AP', 'DR93', 'Gas Range', 'DW11', 'Washer'),
 ('AP', 'DR93', 'Gas Range', 'KL62', 'Dryer'),
 ('AP', 'DR93', 'Gas Range', 'KT03', 'Dishwasher'),
 ('AP', 'DW11', 'Washer', 'KL62', 'Dryer'),
 ('AP', 'DW11', 'Washer', 'KT03', 'Dishwasher'),
 ('AP', 'KL62', 'Dryer', 'KT03', 'Dishwasher')]

D.13. List the order number and order date for each order placed by the customer named Johnsons Department Store. (Hint: To enter an apostrophe (single quotation mark) within a string of characters, type two single quotation marks.)

In [139]:
%%sql
SELECT ORDER_NUM, ORDER_DATE
FROM CUSTOMER NATURAL JOIN ORDERS
WHERE CUSTOMER_NAME = "Johnson's Department Store";

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

D.14. List the order number and order date for each order that contains an order line for an Iron.

In [140]:
%%sql
SELECT ORDER_NUM, ORDER_DATE
FROM ORDERS 
    NATURAL JOIN ORDER_LINE 
    NATURAL JOIN PART
WHERE DESCRIPTION = 'Iron';

 * sqlite://
Done.

[('21608', '20-OCT-2010')]

D.15. List the order number and order date for each order that either was placed by Johnsons Department Store or that contains an order line for a Gas Range.

In [141]:
%%sql
SELECT ORDER_NUM, ORDER_DATE
FROM CUSTOMER 
    NATURAL JOIN ORDERS 
    NATURAL JOIN ORDER_LINE
    NATURAL JOIN PART
WHERE CUSTOMER_NAME = "Johnson's Department Store"
    OR DESCRIPTION = 'Gas Range';

 * sqlite://
Done.

[('21610', '20-OCT-2010'),
 ('21617', '23-OCT-2010'),
 ('21617', '23-OCT-2010'),
 ('21619', '23-OCT-2010'),
 ('21623', '23-OCT-2010')]

D.16. List the order number and order date for each order that was placed by Johnsons Department Store and that contains an order line for a Gas Range.

In [142]:
%%sql
select orders.order_num, orders.order_date
from order_line
 left join part
 on part.part_num = order_line.part_num
right join orders
on orders.order_num = order_line.order_num
left join customer
on orders.customer_num=customer.customer_num
where description = "Gas Range" and customer_name= "Johnsons Department Store"

 * sqlite://
Done.

[]

D.17. List the order number and order date for each order that was placed by Johnsons Department Store but that does not contain an order line for a Gas Range.

In [143]:
%%sql
select orders.order_num, orders.order_date,customer.customer_name
from order_line
 left join part
 on part.part_num = order_line.part_num
right join orders
on orders.order_num = order_line.order_num
left join customer
on orders.customer_num=customer.customer_num
where description != "Gas Range" and customer_name = "Johnson's Department Store"

 * sqlite://
Done.

[('21617', '23-OCT-2010', "Johnson's Department Store"),
 ('21617', '23-OCT-2010', "Johnson's Department Store"),
 ('21623', '23-OCT-2010', "Johnson's Department Store")]

D.18. For each part, list the part number, description, units on hand, order number, and number of units ordered. All parts should be included in the results. For those parts that are currently not on order, the order number and number of units ordered should be left blank (None/NULL/NA). Order the results by part number.

In [144]:
%%sql
select part.part_num, description, on_hand, order_num, num_ordered
from part
 left join order_line
 on part.part_num = order_line.part_num
order by part.part_num

 * sqlite://
Done.

[('AT94', 'Iron', 50, '21608', 11),
 ('BV06', 'Home Gym', 45, '21617', 2),
 ('CD52', 'Microwave Oven', 32, '21617', 4),
 ('DL71', 'Cordless Drill', 21, None, None),
 ('DR93', 'Gas Range', 8, '21610', 1),
 ('DR93', 'Gas Range', 8, '21619', 1),
 ('DW11', 'Washer', 12, '21610', 1),
 ('FD21', 'Stand Mixer', 22, None, None),
 ('KL62', 'Dryer', 12, '21613', 4),
 ('KT03', 'Dishwasher', 8, '21614', 2),
 ('KV29', 'Treadmill', 9, '21623', 2)]